SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Application/Device/MM32F5370/Include/reg_comp.h
/**
  * @brief COMP_COMP3CSR Register Bit Definition
  */
#define  COMP_COMP3CSR_EN_Pos                     (0)
#define  COMP_COMP3CSR_EN_Msk                     (0x1U << COMP_COMP3CSR_EN_Pos)                    /*!<Comparator x Enable This bit switches ON/OFF the comparator.*/
#define  COMP_COMP3CSR_EN                         COMP_COMP3CSR_EN_Msk
#define  COMP_COMP3CSR_MODE_Pos                   (2)
#define  COMP_COMP3CSR_MODE_Msk                   (0x3U << COMP_COMP3CSR_MODE_Pos)                  /*!<Comparator x Mode These bits control the operating mode of the comparator x and allows to adjust the speed/consumption.*/
#define  COMP_COMP3CSR_MODE                       COMP_COMP3CSR_MODE_Msk
#define  COMP_COMP3CSR_MODE_Bit0                  (0x1U << COMP_COMP3CSR_MODE_Pos) 
#define  COMP_COMP3CSR_MODE_Bit1                  (0x2U << COMP_COMP3CSR_MODE_Pos) 
#define  COMP_COMP3CSR_INM_SEL_Pos                (4)
#define  COMP_COMP3CSR_INM_SEL_Msk                (0x7U << COMP_COMP3CSR_INM_SEL_Pos)               /*!<Comparator x Negative Input Selection These bits allows to select the source connected to the negative input end of the comparator x.*/
#define  COMP_COMP3CSR_INM_SEL                    COMP_COMP3CSR_INM_SEL_Msk
#define  COMP_COMP3CSR_INM_SEL_Bit0               (0x1U << COMP_COMP3CSR_INM_SEL_Pos) 
#define  COMP_COMP3CSR_INM_SEL_Bit1               (0x2U << COMP_COMP3CSR_INM_SEL_Pos) 
#define  COMP_COMP3CSR_INM_SEL_Bit2               (0x4U << COMP_COMP3CSR_INM_SEL_Pos) 
#define  COMP_COMP3CSR_INP_SEL_Pos                (7)
#define  COMP_COMP3CSR_INP_SEL_Msk                (0x7U << COMP_COMP3CSR_INP_SEL_Pos)               /*!<Comparator x Positive Input Selection These bits allows to select the source connected to the positive input end of the comparator x.*/
#define  COMP_COMP3CSR_INP_SEL                    COMP_COMP3CSR_INP_SEL_Msk
#define  COMP_COMP3CSR_INP_SEL_Bit0               (0x1U << COMP_COMP3CSR_INP_SEL_Pos) 
#define  COMP_COMP3CSR_INP_SEL_Bit1               (0x2U << COMP_COMP3CSR_INP_SEL_Pos) 
#define  COMP_COMP3CSR_INP_SEL_Bit2               (0x4U << COMP_COMP3CSR_INP_SEL_Pos) 
#define  COMP_COMP3CSR_OUT_SEL_Pos                (10)
#define  COMP_COMP3CSR_OUT_SEL_Msk                (0xFU << COMP_COMP3CSR_OUT_SEL_Pos)               /*!<Comparator x Output Selection These bits select the destination of the comparator x output.*/
#define  COMP_COMP3CSR_OUT_SEL                    COMP_COMP3CSR_OUT_SEL_Msk
#define  COMP_COMP3CSR_OUT_SEL_Bit0               (0x1U << COMP_COMP3CSR_OUT_SEL_Pos) 
#define  COMP_COMP3CSR_OUT_SEL_Bit1               (0x2U << COMP_COMP3CSR_OUT_SEL_Pos) 
#define  COMP_COMP3CSR_OUT_SEL_Bit2               (0x4U << COMP_COMP3CSR_OUT_SEL_Pos) 
#define  COMP_COMP3CSR_OUT_SEL_Bit3               (0x8U << COMP_COMP3CSR_OUT_SEL_Pos) 
#define  COMP_COMP3CSR_POL_Pos                    (15)
#define  COMP_COMP3CSR_POL_Msk                    (0x1U << COMP_COMP3CSR_POL_Pos)                   /*!<Comparator x Output Polarity This bit is used to select the comparator x output polarity*/
#define  COMP_COMP3CSR_POL                        COMP_COMP3CSR_POL_Msk
#define  COMP_COMP3CSR_HYST_Pos                   (16)
#define  COMP_COMP3CSR_HYST_Msk                   (0x3U << COMP_COMP3CSR_HYST_Pos)                  /*!<Comparator x Hysteresis These bits control the comparator x hysteresis level.*/
#define  COMP_COMP3CSR_HYST                       COMP_COMP3CSR_HYST_Msk
#define  COMP_COMP3CSR_HYST_Bit0                  (0x1U << COMP_COMP3CSR_HYST_Pos) 
#define  COMP_COMP3CSR_HYST_Bit1                  (0x2U << COMP_COMP3CSR_HYST_Pos) 
#define  COMP_COMP3CSR_OFLT_Pos                   (18)
#define  COMP_COMP3CSR_OFLT_Msk                   (0x7U << COMP_COMP3CSR_OFLT_Pos)                  /*!<Comparator x Output Filter Period These bits control the comparator x output filter period. When the comparator output signal is horter than the filter period width, it is considered as invalid to be filtered out, otherwise it is considered as valid. n indicates the number of Polling Wait Cycle configured with COMPx_CSR -> PERIOD.n indicates the number of Polling Wait Cycle configured with COMPx_CSR -> PERIOD.*/
#define  COMP_COMP3CSR_OFLT                       COMP_COMP3CSR_OFLT_Msk
#define  COMP_COMP3CSR_OFLT_Bit0                  (0x1U << COMP_COMP3CSR_OFLT_Pos) 
#define  COMP_COMP3CSR_OFLT_Bit1                  (0x2U << COMP_COMP3CSR_OFLT_Pos) 
#define  COMP_COMP3CSR_OFLT_Bit2                  (0x4U << COMP_COMP3CSR_OFLT_Pos) 
#define  COMP_COMP3CSR_WE_Pos                     (28)
#define  COMP_COMP3CSR_WE_Msk                     (0x1U << COMP_COMP3CSR_WE_Pos)                    /*!<Comparator x window control enable This bit enables window control function*/
#define  COMP_COMP3CSR_WE                         COMP_COMP3CSR_WE_Msk
#define  COMP_COMP3CSR_OUT_ANA_SEL_Pos            (29)
#define  COMP_COMP3CSR_OUT_ANA_SEL_Msk            (0x1U << COMP_COMP3CSR_OUT_ANA_SEL_Pos)           /*!<Comparator x output source selection*/
#define  COMP_COMP3CSR_OUT_ANA_SEL                COMP_COMP3CSR_OUT_ANA_SEL_Msk
#define  COMP_COMP3CSR_OUT_Pos                    (30)
#define  COMP_COMP3CSR_OUT_Msk                    (0x1U << COMP_COMP3CSR_OUT_Pos)                   /*!<Comparator x Output This bit indicates the comparator x output state.*/
#define  COMP_COMP3CSR_OUT                        COMP_COMP3CSR_OUT_Msk
#define  COMP_COMP3CSR_LOCK_Pos                   (31)
#define  COMP_COMP3CSR_LOCK_Msk                   (0x1U << COMP_COMP3CSR_LOCK_Pos)                  /*!<Comparator Register Lock This bit is write-once. It is set by software. It can be cleared by a system reset. Once set, it allows to have all control bits of comparator x as read-only.*/
#define  COMP_COMP3CSR_LOCK                       COMP_COMP3CSR_LOCK_Msk


#endif

